app/Controllers/Estudiante.php

SELECT *
FROM `estudiante`
---
    public function index()
    {
        $session = session();
        $model = new EstudianteModel();
        $data['estudiantes'] = $model->findAll();

INSERT INTO `estudiante` (`nombre`, `cedula`) VALUES ('maria', '2300403645')
---
    public function insertar($nombre, $cedula)
    {
        $model = new EstudianteModel();
        $data = [
            'nombre' => $nombre,
            'cedula' => $cedula,
        ];
        $model->insert($data);

DELETE FROM `estudiante`
WHERE `id` IN ('25')
---
    public function eliminar($id)
    {
        $model = new EstudianteModel();
        $model->delete($id);